print('''
ДЗ 2. HW2.

Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
    Попросіть користувача ввести свсвій вік (можно використати константу або input()).
    - якщо користувачу менше 7 - вивести повідомлення "Де твої батьки?"
    - якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
    - якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"
    - якщо вік користувача з двох однакових цифр - вивести повідомлення "Як цікаво!"
    - у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"

P.S. На екран має бути виведено лише одне повідомлення, якщо вік користувача з двох однакових цифр, 
то має бути виведено тільки відповідне повідомлення! Також подумайте над варіантами, коли введені 
невірні або неадекватні дані.\n
''')


input_age = input('Вкажіть, будь ласка, скільки Вам років: ')

while not input_age \
        or not input_age.strip().isdigit() \
        or len(input_age) > 3 \
        or input_age == '0' \
        or int(input_age) > 105:
    print('Ви ввели некоректні вікові дані')
    input_age = input('Спробуйте ще раз, будь ласка: ')

viewer_age = int(input_age)
if viewer_age > 65:
    print('Покажіть пенсійне посвідчення!')
elif viewer_age < 7:
    print('Де твої батьки?')
elif viewer_age < 16:
    print('Це фільм для дорослих!')
else:
    if viewer_age // 10 % 10 == viewer_age % 10:
        print('Як цікаво!')
    else:
        print('А білетів вже немає!')

